marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Can_TS_T40D2M10I1R0/include/Reg_eSys_FlexCan.h
/**
*   @file    Reg_eSys_FlexCan.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Can - MPC560xB FlexCan Registers and Macros Definitions.
*   @details Header file for MPC560xB FlexCan Registers and Macros Definitions.
*
*   @addtogroup CAN_DRIVER
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : FLEXCAN
*   Dependencies         : 
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_2_REV_0002_20180713
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


#ifndef REG_ESYS_FLEXCAN_H
#define REG_ESYS_FLEXCAN_H

#ifdef __cplusplus
extern "C" {
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section Reg_eSys_FlexCan_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section Reg_eSys_FlexCan_h_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
* There are different kinds of execution code sections.
*
* @section Reg_eSys_FlexCan_h_REF_3
* Violates MISRA 2004 Required Rule 1.4, Identifier clash
* This violation is due to the requirement that request to have a file version check.
*
*/


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
/* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h */
#include "Reg_eSys.h"


/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @{
* @brief Internal micro-dependent versioning.
*/
#define CAN_VENDOR_ID_REGFLEX                    43
#define CAN_MODULE_ID_REGFLEX                    80
#define CAN_AR_RELEASE_MAJOR_VERSION_REGFLEX     4
#define CAN_AR_RELEASE_MINOR_VERSION_REGFLEX     2
/*
* @violates @ref Reg_eSys_FlexCan_h_REF_3 Violates MISRA 2004 Required Rule 1.4, Identifier clash
*/
#define CAN_AR_RELEASE_REVISION_VERSION_REGFLEX  2
#define CAN_SW_MAJOR_VERSION_REGFLEX             1
#define CAN_SW_MINOR_VERSION_REGFLEX             0
#define CAN_SW_PATCH_VERSION_REGFLEX             1
/**@}*/

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/
#define REGION_LENGTH (512U)
#define ARBITRATION_FIELD (8U)

/* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.*/   
#define FLEXCAN_MB_OFFSET(mb) ((((&(Can_pCurrentConfig->MBConfigContainer))->pMessageBufferConfigsPtr) + (mb))->u16MBOffsetAddr)

/*******************************************************************************************************************************/



#define     FLEXCAN_32BITS_NO   32

/**
* @brief Macro for Control Register (CTRL) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_RESERVED_MASK(value, null_mask , reserved_mask )    (((value) & (null_mask)) | (reserved_mask))   


#define FLEXCAN_ERRSR_CONFIG_MASK_U32       ((uint32)0x000D000DU)

#define FLEXCAN_MCR_NULL_MASK_U32           ((uint32)0xF2A3F37FU)
#define FLEXCAN_MCR_RESERVED_MASK_U32       ((uint32)0x08100000U)
#define FLEXCAN_CTRL_CONFIG_MASK_U32        ((uint32)0xFFFFFCFFU)
#define FLEXCAN_ECR_CONFIG_MASK_U32         ((uint32)0x0000FFFFU)
#define FLEXCAN_ESR_CONFIG_MASK_U32         ((uint32)0x00030006U)
#define FLEXCAN_IMASK2_CONFIG_MASK_U32      ((uint32)0xFFFFFFFFU)
#define FLEXCAN_IMASK1_CONFIG_MASK_U32      ((uint32)0xFFFFFFFFU)
#define FLEXCAN_IFLAG1_CONFIG_MASK_U32      ((uint32)0xFFFFFFFFU)
#define FLEXCAN_IFLAG2_CONFIG_MASK_U32      ((uint32)0xFFFFFFFFU)
#define FLEXCAN_RXGMASK_CONFIG_MASK_U32     ((uint32)0xFFFFFFFFU)
#define FLEXCAN_RXFGMASK_CONFIG_MASK_U32    ((uint32)0xFFFFFFFFU)
#define FLEXCAN_RX15MASK_CONFIG_MASK_U32    ((uint32)0xFFFFFFFFU)
#define FLEXCAN_RX14MASK_CONFIG_MASK_U32    ((uint32)0xFFFFFFFFU)

#define FLEXCAN_8_BYTES_U32                 ((uint32)0x00000008U)
#define FLEXCAN_16_BYTES_U32                ((uint32)0x00000010U)
#define FLEXCAN_32_BYTES_U32                ((uint32)0x00000020U)
#define FLEXCAN_64_BYTES_U32                ((uint32)0x00000040U)

/**
* @brief Register mask value used for Full can hardware objects.
*/
#define FLEXCAN_NO_MASK_U32                 ((uint32)0xFFFFFFFFU)
/**
* @brief Start memory address offset for a Can controller
*/
#define FLEXCAN_MEMORY_START_U32            ((uint32)0x00000080U)
/**
* @brief End memory address offset for a Can controller
*/
#if (CPU_BYTE_ORDER==HIGH_BYTE_FIRST)
    #define FLEXCAN_MEMORY_END_U32          ((uint32)0x00000ADFU)
#elif(CPU_BYTE_ORDER==LOW_BYTE_FIRST)
    #define FLEXCAN_MEMORY_END_U32          ((uint32)0x0000047FU)
#endif
/**
* @brief Memory size reserved for one Can controller
*/
#define FLEXCAN_OFFSET_U32                  ((uint32)0x00004000U)
/**
* @brief Offset for the first MB
*/
#define FLEXCAN_MB_OFFSET_U32               ((uint32)0x00000080U)
/**
* @brief Offset for the RXIMR register
*/
#define FLEXCAN_RXIMR_OFFSET_U32            ((uint32)0x00000880U)
/**
* @brief Mask for 32 bits register
*/
#define FLEXCAN_32BITMASK_U32               ((uint32)0xFFFFFFFFU)
/**
* @brief Mask for 8 bits of IMASK registers that are reserved for Fifo
*/
#define FLEXCAN_FIFO_MASK_U32               ((uint32)0x000000FFU)
/**
* @brief Define for left shifting 5 bits.
*/
#define FLEXCAN_MB_SHIFT5BIT_U8             ((uint8)0x05U)
/**
* @brief Offset of the CAN_WMB_CS register store configuration of the Message Wake-up.
*/
#define FLEXCAN_CAN_WMB_CS_U32              ((uint32)0x00000B40U)
/**
* @brief Offset of the CAN_WMB_ID register store ID of the Message Wake-up.
*/
#define FLEXCAN_CAN_WMB_ID_U32              ((uint32)0x00000B44U)
/**
* @brief Offset of the CAN_WMB_D03 register store form data number 0 to data number 3 of the Message Wake-up.
*/
#define FLEXCAN_CAN_WMB_D03_U32             ((uint32)0x00000B48U)
/**
* @brief Offset of the CAN_WMB_D47 register store form data number 4 to data number 7 of the Message Wake-up.
*/
#define FLEXCAN_CAN_WMB_D47_U32             ((uint32)0x00000B4CU)
/**
* @brief Offset of the Standard ID in the ID reg of MB.
*/
#define FLEXCAN_STANDARD_ID_SHIFT_U32       ((uint32)18U)
/**
* @brief Offset of the LENGTH field in the MBCS register of MB.
*/
#define FLEXCAN_MBCS_LENGTH_SHIFT_U32       ((uint32)16U)
/**
* @brief Offset of the PRIO field in ID register of the MB.
*/
#define FLEXCAN_MB_ID_PRIO_SHIFT_U32        ((uint32)28U)
/**
* @brief Mask for 32 index values (0 to 31 indexes).
*/
#define FLEXCAN_MASK_32BITS_U32             ((uint32)0x0000001FU)

/**
* @{
* @brief Current architectures of FLEXcan have 32 or 64 MBs for each controller
*/
#define FLEXCAN_MB_32_U8                    32U
#define FLEXCAN_MB_64_U8                    64U
#define FLEXCAN_MB_96_U8                    96U
/**@}*/

/**
* @{
* @brief Define for MB data
*/
#define FLEXCAN_MB_DATABYTE_REG_U32         ((uint32)4U)
#define FLEXCAN_MB_DATABYTE_FIRST_U32       ((uint32)0xFF000000U)
#define CAN_FLEXCAN_8_BYTES_PAYLOAD_U32     ((uint32)0x00080000U)
#define FLEXCAN_DATA_LENGTH_OFFSET_U8       ((uint8) 0x08U)
#define FLEXCAN_DATA_LENGTH_MIN_U8          ((uint8) 0x08U)
#define FLEXCAN_DATA_LENGTH_MAX_U8          ((uint8) 0x0FU)
/**@}*/

/**
* @{
* @maximum threshold values for DLC
*/
#define CAN_FLEXCAN_MAX_PAYLOAD8_U8      ((uint8)8U)
#define CAN_FLEXCAN_MAX_PAYLOAD12_U8     ((uint8)12U)
#define CAN_FLEXCAN_MAX_PAYLOAD16_U8     ((uint8)16U)
#define CAN_FLEXCAN_MAX_PAYLOAD20_U8     ((uint8)20U)
#define CAN_FLEXCAN_MAX_PAYLOAD24_U8     ((uint8)24U)
#define CAN_FLEXCAN_MAX_PAYLOAD32_U8     ((uint8)32U)
#define CAN_FLEXCAN_MAX_PAYLOAD48_U8     ((uint8)48U)
#define CAN_FLEXCAN_MAX_PAYLOAD64_U8     ((uint8)64U)
/**@}*/

/**
* @{
* @minimum threshold values for DLC
*/
#define CAN_FLEXCAN_MIN_PAYLOAD0_U8      ((uint8)0U)
#define CAN_FLEXCAN_MIN_PAYLOAD9_U8      ((uint8)9U)
#define CAN_FLEXCAN_MIN_PAYLOAD13_U8     ((uint8)13U)
#define CAN_FLEXCAN_MIN_PAYLOAD17_U8     ((uint8)17U)
#define CAN_FLEXCAN_MIN_PAYLOAD21_U8     ((uint8)21U)
#define CAN_FLEXCAN_MIN_PAYLOAD25_U8     ((uint8)25U)
#define CAN_FLEXCAN_MIN_PAYLOAD33_U8     ((uint8)33U)
#define CAN_FLEXCAN_MIN_PAYLOAD49_U8     ((uint8)49U)
/**@}*/

/**
* @{
* @number of maximum values in data length code region
*/
#define CAN_FLEXCAN_NUM_VAL_DLC_U8     ((uint8)8U)
/**@}*/

/**
* @{
* @brief Define for filter's payload
*/
#define CAN_FLEXCAN_FILTER_PAYLOAD7_U8       ((uint8)7U)
#define CAN_FLEXCAN_FILTER_PAYLOAD9_U8       ((uint8)9U)
#define CAN_FLEXCAN_FILTER_PAYLOAD11_U8      ((uint8)11U)
#define CAN_FLEXCAN_FILTER_PAYLOAD13_U8      ((uint8)13U)
#define CAN_FLEXCAN_FILTER_PAYLOAD15_U8      ((uint8)15U)
#define CAN_FLEXCAN_FILTER_PAYLOAD17_U8      ((uint8)17U)
#define CAN_FLEXCAN_FILTER_PAYLOAD19_U8      ((uint8)19U)
#define CAN_FLEXCAN_FILTER_PAYLOAD21_U8      ((uint8)21U)
#define CAN_FLEXCAN_FILTER_PAYLOAD23_U8      ((uint8)23U)
#define CAN_FLEXCAN_FILTER_PAYLOAD25_U8      ((uint8)25U)
#define CAN_FLEXCAN_FILTER_PAYLOAD27_U8      ((uint8)27U)
#define CAN_FLEXCAN_FILTER_PAYLOAD29_U8      ((uint8)29U)
#define CAN_FLEXCAN_FILTER_PAYLOAD31_U8      ((uint8)31U)
#define CAN_FLEXCAN_FILTER_PAYLOAD33_U8      ((uint8)33U)
#define CAN_FLEXCAN_FILTER_PAYLOAD35_U8      ((uint8)35U)
#define CAN_FLEXCAN_FILTER_PAYLOAD37_U8      ((uint8)37U)
/**@}*/

/**
* @{
* @number of maximum values in data length code region
*/
#define CAN_FLEXCAN_NUM_FILT_PAYLOAD_U8     ((uint8)16U)
/**@}*/


#if (CAN_BCC_SUPPORT_ENABLE == STD_ON)
/**
* @{
* @brief Define for MB data and interrupt mask initialization value
*/
#define FLEXCAN_MB_14_U8                    ((uint8)14U)
#define FLEXCAN_MB_15_U8                    ((uint8)15U)
#define FLEXCAN_TABLE_ID6_U8                ((uint8)6U)
#define FLEXCAN_TABLE_ID7_U8                ((uint8)7U)
#define FLEXCAN_INTERRUPT_MASKS_INIT_VALUE_U8   ((uint8)0x0U)
/**@}*/
#endif

/**
* @brief Define used for Can_ControlerDescriptorType.u8ControllerOffset when controller is not enabled.
*/
#define FLEXCAN_NULL_OFFSET_U8              ((uint8)0xFFU)



/*==================================================================================================
                BIT MASKS FOR SOFTWARE ERROR FLAGS
==================================================================================================*/
/**
* @brief CTRL: busoff software flag
*/
#define FLEXCAN_SWF_BOFF_MASK_U8            ((uint8)0x02U)
/**
* @brief CTRL: error software flag
*/
#define FLEXCAN_SWF_ERR_MASK_U8             ((uint8)0x04U)
/**
* @brief IMASK2, IMASK1: message buffers software flags
*/
#define FLEXCAN_SWF_MB_MASK_U8              ((uint8)0x08U)
/**
* @brief MCR: tx/rx warning interrupts software flags
*/
#define FLEXCAN_SWF_WRNINT_MASK_U8          ((uint8)0x10U)


/*==================================================================================================
                CONTROLLER OPTIONS
==================================================================================================*/
/**
* @{
* @brief Controller options - set by the Tresos configuration
*/
#define CAN_CONTROLLERCONFIG_BUSOFFSWREC_U32    ((uint32)0x00000001U)
#define CAN_CONTROLLERCONFIG_RXFIFO_U32         ((uint32)0x00000002U)
#define CAN_CONTROLLERCONFIG_IDAM_A_U32         ((uint32)0x00000004U)
#define CAN_CONTROLLERCONFIG_IDAM_B_U32         ((uint32)0x00000008U)
#define CAN_CONTROLLERCONFIG_IDAM_C_U32         ((uint32)0x00000010U)
#define CAN_CONTROLLERCONFIG_IDAM_D_U32         ((uint32)0x00000020U)
#define CAN_CONTROLLERCONFIG_WAKEUP_SRC_U32     ((uint32)0x00000040U)
#define CAN_CONTROLLERCONFIG_LPRIO_EN_U32       ((uint32)0x00000080U)
#define CAN_CONTROLLERCONFIG_OVER_EN_U32        ((uint32)0x00000100U)
#define CAN_CONTROLLERCONFIG_WARN_EN_U32        ((uint32)0x00000200U)
#define CAN_CONTROLLERCONFIG_RXPOL_EN_U32       ((uint32)0x00000400U)
#define CAN_CONTROLLERCONFIG_TXPOL_EN_U32       ((uint32)0x00000800U)
#define CAN_CONTROLLERCONFIG_BOPOL_EN_U32       ((uint32)0x00001000U)
#define CAN_CONTROLLERCONFIG_WKPOL_EN_U32       ((uint32)0x00002000U)
#define CAN_CONTROLLERCONFIG_WRNINT_EN_U32      ((uint32)0x00004000U)
#define CAN_CONTROLLERCONFIG_WAKSUP_EN_U32      ((uint32)0x00008000U)
#define CAN_CONTROLLERCONFIG_ERR_EN_U32         ((uint32)0x00020000U)
#if (CAN_BCC_SUPPORT_ENABLE == STD_ON)
    #define CAN_CONTROLLERCONFIG_BCC_EN_U32     ((uint32)0x00010000U)
#endif /* (CAN_BCC_SUPPORT_ENABLE == STD_ON) */
#define CAN_CONTROLLERCONFIG_IDAM_MASK_U32      ((uint32)0x0000003CU)
/**@}*/

/*==================================================================================================
                            MESSAGE BUFFER BIT MASKS FOR ALL STRUCTURE
==================================================================================================*/
/**
* @brief MB code: bits 27:24 in CS reg
*/
#define FLEXCAN_MBCS_CODE_U32                   ((uint32)0x0F000000U)
/**
* @brief MB code: message buffer used for Tx
*/
#define FLEXCAN_MBCS_CODETX_U32                 ((uint32)0x08000000U)
/**
* @brief MB code: Transmit contents of Tx message buffer
*/
#define FLEXCAN_MBCS_CODETXEN_U32               ((uint32)0x04000000U)
/**
* @brief MB code: transmit the message whenever a remote frame with a matching ID is received
*/
#define FLEXCAN_MBCS_CODETXRTR_U32              ((uint32)0x02000000U)
/**
* @brief MB code: Abort transmission
*/
#define FLEXCAN_MBCS_CODETXABORT_U32            ((uint32)0x01000000U)
/**
* @brief MB code: Message buffer used for Rx
*/
#define FLEXCAN_MBCS_CODERX_U32                 ((uint32)0x00000000U)
/**
* @brief MB code: Rx message buffer overrun (a new message arrived before the previous one was picked-up)
*/
#define FLEXCAN_MBCS_CODERXOVRR_U32             ((uint32)0x06000000U)
/**
* @brief MB code: Rx message buffer empty
*/
#define FLEXCAN_MBCS_CODERXEMPTY_U32            ((uint32)0x04000000U)
/**
* @brief MB code: Rx message buffer is full (a new message has arrived)
*/
#define FLEXCAN_MBCS_CODERXFULL_U32             ((uint32)0x02000000U)
/**
* @brief MB code: MB busy and cannot be read
*/
#define FLEXCAN_MBCS_CODERXBUSY_U32             ((uint32)0x01000000U)
/**
* @brief SRR bit, must be written as '1' in any Tx MB
*/
#define FLEXCAN_MBCS_SRR_U32                    ((uint32)0x00400000U)
/**
* @brief IDE bit, 0=standard ID, 1=extended ID
*/
#define FLEXCAN_MBCS_IDE_U32                    ((uint32)0x00200000U)
/**
* @brief RTR bit, 0=data frame, 1=remote frame
*/
#define FLEXCAN_MBCS_RTR_U32                    ((uint32)0x00100000U)
/**
* @brief DLC (data length code)
*/
#define FLEXCAN_MBCS_LENGTH_U32                 ((uint32)0x000F0000U)
/**
* @brief Time stamp of Rx and Tx frames (timer value captured at the time the beginning of the ID appears on the bus)
*/
#define FLEXCAN_MBCS_TIMESTAMP_U32              ((uint32)0x0000FFFFU)
/**
* @brief Local Tx priority (added in front of the ID to determine Tx priority)
*/
#define FLEXCAN_MBID_PRIO_U32                   ((uint32)0xE0000000U)
/**
* @brief Extended (bits 0-28) ID
*/
#define FLEXCAN_MBID_ID_EXTENDED_U32            ((uint32)0x1FFFFFFFU)
/**
* @brief IDE flag used in extended ID mode to identify whether the ID is Extended/Standard.(According to Can_IdType from SWS_Can_Driver.pdf of ASR3.0)
*/
#define FLEXCAN_MBC_ID_IDE_U32                  ((uint32)0x80000000U)
/**
* @brief Standard (bits 18-28) ID
*/
#define FLEXCAN_MBID_ID_STANDARD_U32            ((uint32)0x1FFC0000U)




/*==================================================================================================
                    INTERRUPT MASKS & FLAGS REGISTERS:
                        IMASK2 (Base + 0x0024); IMASK1 (Base + 0x0028)
                        IFLAG2 (Base + 0x002C); IFLAG1 (Base + 0x0030)
==================================================================================================*/
/**
* @{
* @brief Imask and Iflag index registers
*/
#if (CAN_MAXMB_SUPPORTED == FLEXCAN_MB_64_U8 )
  #define FLEXCAN_IMASK3_INDEX_U8               ((uint8)2U)
  #define FLEXCAN_IMASK2_INDEX_U8               ((uint8)1U)
  #define FLEXCAN_IFLAG3_INDEX_U8               ((uint8)2U)
  #define FLEXCAN_IFLAG2_INDEX_U8               ((uint8)1U)
#endif

#define FLEXCAN_IMASK1_INDEX_U8               ((uint8)0U)
#define FLEXCAN_IFLAG1_INDEX_U8               ((uint8)0U)

/**@}*/

