marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Can_TS_T40D2M10I1R0/include/Reg_eSys_FlexCan.h
/*==================================================================================================
                BIT MASKS FOR MODULE CONFIGURATION REGISTER: MCR (Base+0x0000)
==================================================================================================*/
/**
* @brief MCR bit31: Module Disable (module disabled when 1)
*/
#define FLEXCAN_MCR_MDIS_U32                    ((uint32)0x80000000U)
/**
* @brief MCR bit30: Freeze enable (enable to enter freeze mode when HALT is set)
*/
#define FLEXCAN_MCR_FRZ_U32                     ((uint32)0x40000000U)
/**
* @brief MCR bit29: FIFO mode enable
*/
#define FLEXCAN_MCR_FEN_U32                     ((uint32)0x20000000U)
/**
* @brief MCR bit28: Module Halt (module enters freeze mode when this bit is set providing the FRZ bit is set)
*/
#define FLEXCAN_MCR_HALT_U32                    ((uint32)0x10000000U)
/**
* @brief MCR bit27: Module Not Ready (either disabled or in freeze mode)
*/
#define FLEXCAN_MCR_NOTRDY_U32                  ((uint32)0x08000000U)
/**
* @brief MCR bit26: Wake Up Interrupt Mask (1 = Wake Up Interrupt is enabled, 0 = Wake Up Interrupt is disabled)
*/
#define FLEXCAN_MCR_WAK_MSK_U32                 ((uint32)0x04000000U)
/**
* @brief MCR bit25: Module Soft Reset (the bit remains set until reset is completed)
*/
#define FLEXCAN_MCR_SOFTRST_U32                 ((uint32)0x02000000U)
/**
* @brief MCR bit24: Freeze Mode Acknowledge
*/
#define FLEXCAN_MCR_FRZACK_U32                  ((uint32)0x01000000U)
/**
* @brief MCR bit23: Supervisor Mode (1 = Affected registers are in Supervisor memory space.
* @details    MCR bit23: Supervisor Mode (1 = Affected registers are in Supervisor memory space.
* Any access without supervisor permission behaves as though the access was done
*    to an unimplemented register location 0 = Affected registers are in Unrestricted memory space)
*/
#define FLEXCAN_MCR_SUPV_U32                    ((uint32)0x00800000U)
/**
* @brief MCR bit22: Self Wakeup from Doze or Stop modes
*/
#define FLEXCAN_MCR_SLF_WAK_U32                 ((uint32)0x00400000U)
/**
* @brief MCR bit21: Warning interrupt enable (TWRNINT and RWRNINT flags generate an iterrupt if set)
*/
#define FLEXCAN_MCR_WRNEN_U32                   ((uint32)0x00200000U)
/**
* @brief MCR bit20: Module Disable Acknowledge
*/
#define FLEXCAN_MCR_LPMACK_U32                  ((uint32)0x00100000U)
/**
* @brief MCR bit19: Wake Up Source
* @details MCR bit19: Wake Up Source (1 = FlexCAN uses the filtered Rx input to detect recessive to dominant edges on the CAN bus,
*                                     0 = FlexCAN uses the unfiltered Rx input to detect recessive to dominant edges on the CAN bus)
*/
#define FLEXCAN_MCR_WAK_SRC_U32                 ((uint32)0x00080000U)
/**
* @brief MCR bit18: Doze Mode Enable
* @details MCR bit18: Doze Mode Enable (1 = FlexCAN is enabled to enter low power mode when Doze
*                                   Mode is requested, 0 = FlexCAN is not enabled to enter low power mode when Doze Mode is requested)
*/
#define FLEXCAN_MCR_DOZE_U32                    ((uint32)0x00040000U)
/**
* @brief MCR bit17: Self Rx Disable (module will receive its own Tx messages when cleared)
*/
#define FLEXCAN_MCR_SRXDIS_U32                  ((uint32)0x00020000U)
/**
* @brief MCR bit16: Backwards Compatibility Configuration (individual message buffer masks are used when set, global & MB14,MB15 masks are used when cleared)
*/
#define FLEXCAN_MCR_BCC_U32                     ((uint32)0x00010000U)
#if (CAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/**
* @brief MCR bit15: Pretended Networking feature (only Calypso Platform)
*/
#define FLEXCAN_PNET_ENABLE_U32                 ((uint32)0x00004000U)
#define FLEXCAN_CTRL1_PN_NMATCH_U32             ((uint32)0x0000FF00U)
#define FLEXCAN_CTRL2_PN_MATCHTO_U32            ((uint32)0x0000FFFFU)
#define FLEXCAN_CAN_FLT_ID1_U32                 ((uint32)0x7FFFFFFFU)
#define FLEXCAN_CAN_FLT_ID2_IDMASK_U32          ((uint32)0x7FFFFFFFU)
#define FLEXCAN_CAN_FLT_DLC_U32                 ((uint32)0x000F000FU)
#define FLEXCAN_CTRL1_PN_CONFIG_U32             ((uint32)0x0003003FU) 
#define FLEXCAN_CTRL1_PN_WTOF_U32               ((uint32)0x00020000U)
#define FLEXCAN_CTRL1_PN_WUMF_U32               ((uint32)0x00010000U)
#define FLEXCAN_WU_MTC_MCOUNTER                 ((uint32)0x0000FF00U)
#define FLEXCAN_WU_MTC_WUMF_MSK_U32             ((uint32)0x00010000U)
#define FLEXCAN_WU_MTC_WTOF_MSK_U32             ((uint32)0x00020000U)
#define FLEXCAN_WU_MTC_WUMF_MSK_W1C             ((uint32)0x00010000U)
#define FLEXCAN_WU_MTC_WTOF_MSK_W1C             ((uint32)0x00020000U)
#define FLEXCAN_CAN_WMB_ID_IDMB_U32             ((uint32)0x1FFFFFFFU)
#define FLEXCAN_CAN_WMB_CS_DLC_U32              ((uint32)0x000F0000U)
#define FLEXCAN_CAN_WMB_CS_IDE_U32              ((uint32)0x00200000U)
#define FLEXCAN_EXACTLY_PAYLOAD_U32             ((uint32)0x00000000U)
#define FLEXCAN_GREATER_PAYLOAD_U32             ((uint32)0x00000010U)
#define FLEXCAN_SMALLER_PAYLOAD_U32             ((uint32)0x00000020U)
#define FLEXCAN_INSIDE_RANGE_PAYLOAD_U32        ((uint32)0x00000030U)
#define FLEXCAN_EXACTLY_ID_U32                  ((uint32)0x00000000U)
#define FLEXCAN_GREATER_ID_U32                  ((uint32)0x00000004U)
#define FLEXCAN_SMALLER_ID_U32                  ((uint32)0x00000008U)
#define FLEXCAN_INSIDE_RANGE_ID_U32             ((uint32)0x0000000CU)
#endif
/**
* @brief MCR bit13: Local Priority Enable (the PRIO field in Tx MB ID is used when set)
*/
#define FLEXCAN_MCR_LPRIOEN_U32                 ((uint32)0x00002000U)
/**
* @brief MCR bit12: Abort Enable (Tx abort is enabled when set)
*/
#define FLEXCAN_MCR_AEN_U32                     ((uint32)0x00001000U)
/**
* @brief MCR bit9-8: ID acceptance mode for the FIFO mode
*/
#define FLEXCAN_MCR_IDAM_U32                    ((uint32)0x00000300U)
/**
* @brief             ID acceptance mode: one standard or extended ID
*/
#define FLEXCAN_MCR_IDAM32_U32                  ((uint32)0x00000000U)
/**
* @brief             ID acceptance mode: two standard or partial extended IDs
*/
#define FLEXCAN_MCR_IDAM16_U32                  ((uint32)0x00000100U)
/**
* @brief             ID acceptance mode: four partial standard or extended IDs
*/
#define FLEXCAN_MCR_IDAM08_U32                  ((uint32)0x00000200U)
/**
* @brief MCR bit5-0: Maximum number of MBs in use (field value plus 1)
*/
#define FLEXCAN_MCR_MAXMB_U32                   ((uint32)0x0000003FU)


/*==================================================================================================
                BIT MASKS FOR CONTROL REGISTER: CTRL (Base+0x0004)
==================================================================================================*/
/**
* @brief CTRL bit31-24: Clock divider (clock is divided by field value plus 1)
*/
#define FLEXCAN_CTRL_PRESDIV_U32                ((uint32)0xFF000000U)
/**
* @brief CTRL bit23-22: Resynchronization jump width (the width is field value plus 1 time quantum)
*/
#define FLEXCAN_CTRL_RJW_U32                    ((uint32)0x00C00000U)
/**
* @brief CTRL bit21-19: Phase segment 1 (length of the segment is field value plus 1 time quantum)
*/
#define FLEXCAN_CTRL_PSEG1_U32                  ((uint32)0x00380000U)
/**
* @brief CTRL bit18-16: Phase segment 2 (length of the segment is field value plus 1 time quantum)
*/
#define FLEXCAN_CTRL_PSEG2_U32                  ((uint32)0x00070000U)
/**
* @brief CTRL bit15: Bus Off Mask (bus off interrupt enabled when set)
*/
#define FLEXCAN_CTRL_BOFFMSK_U32                ((uint32)0x00008000U)
/**
* @brief CTRL bit14: Error Mask (error interrupt enabled when set)
*/
#define FLEXCAN_CTRL_ERRMSK_U32                 ((uint32)0x00004000U)
/**
* @brief CTRL bit12: Loop-Back mode (loop-back mode enabled when set)
*/
#define FLEXCAN_CTRL_LPB_U32                    ((uint32)0x00001000U)
/**
* @brief CTRL bit11: Tx Warning interrupt enable (enabled when bit is set)
*/
#define FLEXCAN_CTRL_TWRNMSK_U32                ((uint32)0x00000800U)
/**
* @brief CTRL bit10: Rx Warning interrupt enable (enabled when bit is set)
*/
#define FLEXCAN_CTRL_RWRNMSK_U32                ((uint32)0x00000400U)
/**
* @brief CTRL bit7: Sampling mode (0=1 sample, 1=3 samples)
*/
#define FLEXCAN_CTRL_SMP_U32                    ((uint32)0x00000080U)
/**
* @brief CTRL bit6: Bus off recovery mode (0=automatic, 1=manual)
*/
#define FLEXCAN_CTRL_BOFFREC_U32                ((uint32)0x00000040U)
/**
* @brief CTRL bit5: Timer Synchronization (when set the free-running timer is reset each time a message is received into MB0)
*/
#define FLEXCAN_CTRL_TSYN_U32                   ((uint32)0x00000020U)
/**
* @brief CTRL bit4: Lowest Buffer First (0=highest priority buffer transmitted first, 1=lowest numbered buffer transmitted first)
*/
#define FLEXCAN_CTRL_LBUF_U32                   ((uint32)0x00000010U)
/**
* @brief CTRL bit3: Listen only mode (listen only mode is enabled when bit is set)
*/
#define FLEXCAN_CTRL_LOM_U32                    ((uint32)0x00000008U)
/**
* @brief CTRL bit2-0: Propagation Segment (length of the segment is field value plus 1 time quantum)
*/
#define FLEXCAN_CTRL_PROPSEG_U32                ((uint32)0x00000007U)

/*==================================================================================================
                BIT MASKS FOR SHIFTING CONTROL REGISTER VALUES
==================================================================================================*/
/**
* @{
* @brief Offset bits for CTRL register
*/
#define FLEXCAN_CTRL_PRESDIV_SHIFT_U8           ((uint8)24U)
#define FLEXCAN_CTRL_RJW_SHIFT_U8               ((uint8)22U)
#define FLEXCAN_CTRL_PSEG1_SHIFT_U8             ((uint8)19U)
#define FLEXCAN_CTRL_PSEG2_SHIFT_U8             ((uint8)16U)
#define FLEXCAN_CTRL_CLKSRC_SHIFT_U8            ((uint8)13U)
#define FLEXCAN_CTRL_LPB_SHIFT_U8               ((uint8)12U)
#define FLEXCAN_CTRL_SMP_SHIFT_U8               ((uint8) 7U)
#define FLEXCAN_CTRL_BOFFREC_SHIFT_U8           ((uint8) 6U)
#define FLEXCAN_CTRL_LBUF_SHIFT_U8              ((uint8) 4U)
#define FLEXCAN_CTRL_LOM_SHIFT_U8               ((uint8) 3U)
/**@}*/

/**
* @{
* @brief Offset bits for CTRL2 register
*/
#define FLEXCAN_CTRL2_TASD_SHIFT_U32            ((uint32)19U)

/*Offset bits for FD register*/
#define FLEXCAN_FD_OFFSET_U8                    ((uint8)11U)
#define FLEXCAN_FD_PROPSEG_OFFSET_U8            ((uint8)10U)
#define FLEXCAN_FD_PSEG1_OFFSET_U8              ((uint8) 5U)
#define FLEXCAN_FD_PSEG2_OFFSET_U8              ((uint8) 0U) 
#define FLEXCAN_FD_SJW_OFFSET_U8                ((uint8)16U) 
#define FLEXCAN_FD_BRS_OFFSET_U8                ((uint8)31U)
#define FLEXCAN_MBDSR0_OFFSET_U8                ((uint8)16U)
#define FLEXCAN_MBDSR1_OFFSET_U8                ((uint8)19U)
#define FLEXCAN_MBDSR2_OFFSET_U8                ((uint8)22U)
#define FLEXCAN_FD_PRESDIV_OFFSET_U8            ((uint8)20U)
#define FLEXCAN_FDCTRL_TDCOFF_OFFSET_U8         ((uint8) 8U)
#define FLEXCAN_FD_CTRL2_STFCNTEN_SHIFT_U32     ((uint32)12U)
#define FLEXCAN_FD_CTRL2_EDFLTDIS_SHIFT_U32     ((uint32)11U)
#define FLEXCAN_FD_CTRL2_PREXCEN_SHIFT_U32      ((uint32)14U)

