marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Can_TS_T40D2M10I1R0/include/Reg_eSys_FlexCan.h
#define CAN_8_BYTES_PAYLOAD_U32     ((uint32)0U)
#define CAN_16_BYTES_PAYLOAD_U32    ((uint32)1U)
#define CAN_32_BYTES_PAYLOAD_U32    ((uint32)2U)
#define CAN_64_BYTES_PAYLOAD_U32    ((uint32)3U)

#ifdef CAN_EXTENDEDID
    #if (CAN_EXTENDEDID == STD_ON)
        #define CAN_FD_ID_DESCRIPTOR            ((uint32)0x40000000)       
    #else /* (CAN_EXTENDEDID == STD_OFF) */
    #define CAN_FD_ID_DESCRIPTOR                ((uint16)0x4000)       
    #endif /* (CAN_EXTENDEDID == STD_ON/STD_OFF) */
#endif              

#define FLEXCAN_REMOVE_DLC_U8                   ((uint32)0xFFF0FFFFU)

/*Offset bits for CBT register*/
#define FLEXCAN_CBT_OFFSET_U8                   ((uint8)31U)
#define FLEXCAN_FD_PRESDIV_CBT_OFFSET_U8        ((uint8)21U)
#define FLEXCAN_CBT_PROPSEG_OFFSET_U8           ((uint8)10U)
#define FLEXCAN_CBT_PSEG1_OFFSET_U8             ((uint8) 5U) 
#define FLEXCAN_CBT_PSEG2_OFFSET_U8             ((uint8) 0U) 
#define FLEXCAN_CBT_SJW_OFFSET_U8               ((uint8)16U)

/**
* @brief BTF bit31: Enable values from CBT register to replace values from CTRL register
*/
#define FLEXCAN_CBT_BTF_U32                     ((uint32)0x80000000U)

/**
* @brief FDEN bit11: Enable FD
*/
#define FLEXCAN_MCR_FDEN_U32                    ((uint32)0x00000800U)

/**
* @brief EDL + BRS bit30 and BIT 31: Enable FD and BRS in MB
*/
#define FLEXCAN_MB_EDL_BRS_U32                  ((uint32)0xC0000000U)


/**
* @brief ESR bit17: Tx error warning interrupt flag (set when TXWRN becomes set while WRNEN is set)
*/
#define FLEXCAN_FD_MB_MESSAGE_U32               ((uint32)0xC0000000U)
/*==================================================================================================
                BIT MASKS FOR ERROR AND STATUS REGISTER: ESR (Base+0x0020)
==================================================================================================*/
/**
* @brief ESR bit17: Tx error warning interrupt flag (set when TXWRN becomes set while WRNEN is set)
*/
#define FLEXCAN_ESR_TWRNINT_U32                 ((uint32)0x00020000U)
/**
* @brief ESR bit16: Rx error warning interrupt flag (set when RXWRN becomes set while WRNEN is set)
*/
#define FLEXCAN_ESR_RWRNINT_U32                 ((uint32)0x00010000U)
/**
* @brief ESR bit15: Recessive bit error (when set it indicates that at least one bit wans transmitted as recessive, but received as dominant)
*/
#define FLEXCAN_ESR_BIT1ERR_U32                 ((uint32)0x00008000U)
/**
* @brief ESR bit14: Dominant bit error (when set it indicates that at least one bit wans transmitted as dominant, but received as recessive)
*/
#define FLEXCAN_ESR_BIT0ERR_U32                 ((uint32)0x00004000U)
/**
* @brief ESR bit13: Acknowledge error (dominant acknowledge has been detected)
*/
#define FLEXCAN_ESR_ACKERR_U32                  ((uint32)0x00002000U)
/**
* @brief ESR bit12: CRC error detected
*/
#define FLEXCAN_ESR_CRCERR_U32                  ((uint32)0x00001000U)
/**
* @brief ESR bit11: Form error detected
*/
#define FLEXCAN_ESR_FRMERR_U32                  ((uint32)0x00000800U)
/**
* @brief ESR bit10: Stuffing error detected
*/
#define FLEXCAN_ESR_STFERR_U32                  ((uint32)0x00000400U)
/**
* @brief ESR bit9: Tx error warning flag (set when Tx error counter >=96)
*/
#define FLEXCAN_ESR_TXWRN_U32                   ((uint32)0x00000200U)
/**
* @brief ESR bit8: Rx error warning flag (set when Rx error counter >=96)
*/
#define FLEXCAN_ESR_RXWRN_U32                   ((uint32)0x00000100U)
/**
* @brief ESR bit7: Can bus IDLE
*/
#define FLEXCAN_ESR_IDLE_U32                    ((uint32)0x00000080U)
/**
* @brief ESR bit6: Indicates type of activity when IDLE==0 (0=Rx, 1=Tx)
*/
#define FLEXCAN_ESR_TXRX_U32                    ((uint32)0x00000040U)
/**
* @brief ESR bit5-4: Fault state (00=error active, 01=error passive, 1x=bus off)
*/
#define FLEXCAN_ESR_FLTCONF_U32                 ((uint32)0x00000030U)
/**
* @brief ESR bit2: Bus off interrupt flag (set after the module enters bus off state)
*/
#define FLEXCAN_ESR_BOFFINT_U32                 ((uint32)0x00000004U)
/**
* @brief ESR bit1: Error interrupt flag (set when at least one of the error bits (BIT1ERR..STFERR) is set)
*/
#define FLEXCAN_ESR_ERRINT_U32                  ((uint32)0x00000002U)
/**
* @brief ESR bit0: Wake-Up Interrupt (1 = Indicates a recessive to dominant transition received on the CAN bus when the FlexCAN module is in Doze Mode or Stop Mode,
*/
#define FLEXCAN_ESR_WAK_INT_U32                 ((uint32)0x00000001U)

/*==================================================================================================
                BIT MASKS FOR CONTROL 2 REGISTER: CTRL2 (Base+0x0034)
==================================================================================================*/
/**
* @brief CTRL bit27-24: Number Of Rx FIFO Filters
*/
#define FLEXCAN_CTRL2_RFFN_U32                  ((uint32)0x0F000000U)
/**
* @brief CTRL2 bit3: Write-Access To Memory In Freeze Mode
*/
#define FLEXCAN_CTRL2_WRMFRZ_U32                ((uint32)0x10000000U)
/**
* @brief CTRL2 bit2: Error-correction Configuration Register Write Enable
*/
#define FLEXCAN_CTRL2_ECRWRE_U32                ((uint32)0x20000000U)
/**
* @brief CTRL2 bit19-23: Tx Arbitration Start Delay bit field
*/
#define FLEXCAN_CTRL2_TASD_U32                  ((uint32)0x00F80000U)
/**
* @brief CTRL2[STFCNTEN] bit19: support the select ISO or non-ISO for CAN FD
*/
#define FLEXCAN_FD_CTRL2_STFCNTEN_U32           ((uint32)0x00001000U)
/**
* @brief CTRL2[EDFLTDIS] bit11: Edge Filter Disable 
*/
#define FLEXCAN_FD_CTRL2_EDFLTDIS_U32           ((uint32)0x00000800U)
/**
* @brief CTRL2[PREXCEN] bit14: Protocol Exception Enable
*/
#define FLEXCAN_FD_CTRL2_PREXCEN_U32            ((uint32)0x00004000U)
/*==================================================================================================
                BIT MASKS FOR MEMORY ERROR CONTROL REGISTER: MECR (Base+0x0AE0)
==================================================================================================*/
/**
* @brief MECR bit13: FlexCAN Access With Non-Correctable Errors Interrupt Mask
*/
#define FLEXCAN_MECR_FANCEI_U32                 ((uint32)0x00040000U)

/**
* @brief MECR bit12: Host Access With Non-Correctable Errors Interrupt Mask
*/
#define FLEXCAN_MECR_HANCEI_U32                 ((uint32)0x00080000U)

/**
* @brief MECR bit0: Error Configuration Register Write Disable
*/
#define FLEXCAN_MECR_ECRWRDIS_U32               ((uint32)0x80000000U)
/**
* @brief MECR bit24: Non-Correctable Errors In FlexCAN Access Put Device In Freeze Mode
*/
#define FLEXCAN_MECR_ECCDIS_U32                 ((uint32)0x00000100U)

/*==================================================================================================
                BIT MASKS FOR CAN FD CONTROL REGISTER: FDCTRL (Base+0x0C00)
==================================================================================================*/
/**
* @brief FDCTRL bit31: Enable values bit rate switch
*/
#define FLEXCAN_FDCTRL_FDRATE_U32               ((uint32)0x80000000U)
/**
* @brief FDCTRL bit15: Enable Transceiver Delay Compensation
*/
#define FLEXCAN_FDCTRL_TDCEN_U32                ((uint32)0x00008000U)
/**
* @brief FDCTRL bit23-22: Message Buffer Data Size for Region 2
*/
#define FLEXCAN_FDCTRL_MBDSR2_U32               ((uint32)0x00C00000U)
/**
* @brief FDCTRL bit20-19: Message Buffer Data Size for Region 1
*/
#define FLEXCAN_FDCTRL_MBDSR1_U32               ((uint32)0x00180000U)
/**
* @brief FDCTRL bit17-16: Message Buffer Data Size for Region 0
*/
#define FLEXCAN_FDCTRL_MBDSR0_U32               ((uint32)0x00030000U)
/**
* @brief FDCTRL bit12-08: Transceiver Delay Compensation Offset
*/
#define FLEXCAN_FDCTRL_TDCOFF_U32               ((uint32)0x00001F00U)
/**
* @brief FDCTRL bit23-22: Mask Message Buffer Data Size for three Regions
*/
#define FLEXCAN_FDCTRL_MBDSR_MASK_U32           ((uint32)0x00DB0000U)
/*==================================================================================================
                BIT MASKS FOR FIFO INTs
==================================================================================================*/
#if (CAN_RXFIFO_ENABLE == STD_ON)
/**
* @brief Overflow Condition: bit7 of IFRL register
*/
#define FLEXCAN_FIFO_OVERFLOW_INT_MASK_U32      ((uint32)0x00000080U)
/**
* @brief Fifo Warning: bit6 of IFRL register
*/
#define FLEXCAN_FIFO_WARNING_INT_MASK_U32       ((uint32)0x00000040U)
/**
* @brief Fifo Available: bit5 of IFRL register
*/
#define FLEXCAN_FIFO_AVAILABLE_INT_MASK_U32     ((uint32)0x00000020U)

/**
* @brief Buffer MB7 Interrupt or FIFO Overflow
*/
#define FLEXCAN_FIFOOVERFLOW_INT_INDEX_U8       ((uint8)0x07U)
/**
* @brief Buffer MB6 Interrupt or FIFO Warning
*/
#define FLEXCAN_FIFOWARNING_INT_INDEX_U8        ((uint8)0x06U)
/**
* @brief Buffer MB5 Interruptor Frames Available in FIFO
*/
#define FLEXCAN_FIFOFRAME_INT_INDEX_U8          ((uint8)0x05U)

/**
* @brief Message buffers used by FIFO engine
*/
#define FLEXCAN_FIFO_MB_COUNT_U8                ((uint8)0x08U)
/**
* @brief Used to write table ID
*/
#define FLEXCAN_TABLEID_ADDR_OFFSET_U32         ((uint32)0x000000E0U)

/**
* @brief Specify the depth of FIFO structure
*/
#define FLEXCAN_FIFO_DEPTH_U8                   ((uint8)6U)

/**
* @brief Specify the times (in the depth of FIFO) for searching available Rx MBs in FIFO
*/
#define FLEXCAN_FIFO_DEPTH_UNIT_U8              ((uint8)2U)

/**
* @brief CTRL bit0: Buffer MB0 Interrupt Or Clear FIFO bit
*/
#define FLEXCAN_IFLAG1_BUF0I_U32                ((uint32)0x00000001U)

#endif /* (CAN_RXFIFO_ENABLE == STD_ON) */

/*==================================================================================================
                              FLEXCAN Register address calculation Macros
==================================================================================================*/

/**
* @brief Macro for Returning Base address of the controller.
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define CAN_GET_BASE_ADDRESS(offset) ( (uint32)( Can_u32BaseAddress[(offset)] ) )


/**
* @brief Macro for Module Configuration (MCR) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_MCR(offset)         ( (uint32)( CAN_GET_BASE_ADDRESS(offset) ) )



/**
* @brief Macro for Control Register (CTRL) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CTRL(offset)        ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x04U ) )



/**
* @brief Macro for Free Running Timer (TIMER) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_TIMER(offset)       ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x08U ) )


/**
* @brief Macro for Rx Global Mask (RXGMASK) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_RXGMASK(offset)     ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x10U ) )



/**
* @brief Macro for Rx Buffer 14 Mask (RX14MASK) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_RX14MASK(offset)    ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x14U ) )



/**
* @brief Macro for Rx Buffer 15 Mask (RX15MASK) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_RX15MASK(offset)    ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x18U ) )



/**
* @brief Macro for Error Counter Register (ECR) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_ECR(offset)         ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x1CU ) )



/**
* @brief Macro for Error and Status Register (ESR) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_ESR(offset)         ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x20U ) )




/**
* @brief Macro for Interrupt Masks 1 (IMASK1) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_IMASK1(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x28U ) )
/**
* @brief Macro for Interrupt Flags 1 (IFLAG1) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_IFLAG1(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x30U ) )

