marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Can_TS_T40D2M10I1R0/include/Reg_eSys_FlexCan.h
#if ((CAN_MAXMB_SUPPORTED == FLEXCAN_MB_64_U8) || (CAN_MAXMB_SUPPORTED == FLEXCAN_MB_96_U8 )) 
/**
* @brief Macro for Interrupt Masks 2 (IMASK2) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_IMASK2(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x24U ) )

/**
* @brief Macro for Interrupt Flags 2 (IFLAG2) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_IFLAG2(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x2CU ) )
#endif

 #if  (CAN_MAXMB_SUPPORTED == FLEXCAN_MB_96_U8 )
/**
* @brief Macro for Interrupt Masks 2 (IMASK2) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_IMASK3(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x6CU ) )

/**
* @brief Macro for Interrupt Flags 3 (IFLAG3) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_IFLAG3(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x74U ) )
#endif

/**
* @brief Macro for Control Register 2 (CTRL2) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_CTRL2(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x34U ) )


/**
* @brief Macro for Rx Fifo Global Mask (RXFGMASK) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_RXFGMASK(offset)     ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x48U ) )


/**
* @brief Macro for RxFifo structure ID Table 0-7 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_RXFIFO_ID(offset, id)  ( (uint32)( CAN_GET_BASE_ADDRESS(offset) +  \
                                                   (uint32)FLEXCAN_TABLEID_ADDR_OFFSET_U32 + (uint32)((id) *0x04U) ))



/**
* @brief Macro for Message Buffers MB0_MB63 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_MB(offset, mb) ((uint32)( CAN_GET_BASE_ADDRESS(offset) + (uint32)(FLEXCAN_MB_OFFSET(mb) ) ))

/**
* @brief Macro for Message Buffers ID of MB0_MB63 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_MB_ID(offset, mb)       ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                   ((uint32)(FLEXCAN_MB_OFFSET(mb) ) + (uint32)(0x04U)) ))

/**
* @brief Macro for Rx Individual Mask Registers RXIMR0_RXIMR63 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_RXIMR(offset, mb)           ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                        (uint32)(FLEXCAN_RXIMR_OFFSET_U32) + \
                                                        (uint32)((mb) * 0x04U) ))

/**
* @brief Macro for Message Buffers DATA0 - DATA7 of MB0_MB63 register access
*/


#if (CPU_BYTE_ORDER==LOW_BYTE_FIRST)
/* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.*/
#define FLEXCAN_MB_DATA(offset, mb, databyte)   ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                           (uint32)((FLEXCAN_MB_OFFSET(mb)) + (uint32)0x08U + ((((uint32)(databyte) & 0xFCU) + 3U)-((uint32)(databyte) & 3U)))))
                                                            
#elif (CPU_BYTE_ORDER==HIGH_BYTE_FIRST)    
/* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.*/                                                   
#define FLEXCAN_MB_DATA(offset, mb, databyte)    ((uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                           (uint32)((FLEXCAN_MB_OFFSET(mb) ) + (uint32)0x08U + (uint32)(databyte)) ))

#endif

/**
* @brief Macro for Memory Error Control Register (MECR) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_MECR(offset)        ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0xAE0U ) )

/**
* @brief Macro for ERRSR register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_ERRSR(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0AFCU ) )

/**
* @brief Macro for CAN_CTRL1_PN register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_CTRL1_PN(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B00U ) )

/**
* @brief Macro for CAN_CTRL2_PN register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_CTRL2_PN(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B04U ) )

/**
* @brief Macro for CAN_WU_MTC register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_WU_MTC(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B08U ) )

/**
* @brief Macro for CAN_FLT_ID1 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_FLT_ID1(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B0CU ) )

/**
* @brief Macro for CAN_FLT_DLC register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_FLT_DLC(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B10U ) )

/**
* @brief Macro for CAN_PL1_LO register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_PL1_LO(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B14U ) )

/**
* @brief Macro for CAN_PL1_HI register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_PL1_HI(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B18U ) )

/**
* @brief Macro for CAN_FLT_ID2_IDMASK register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_FLT_ID2_IDMASK(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B1CU ) )

/**
* @brief Macro for CAN_PL2_PLMASK_LO register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_PL2_PLMASK_LO(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B20U ) )

/**
* @brief Macro for CAN_PL2_PLMASK_HI register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_PL2_PLMASK_HI(offset)      ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x0B24U ) )

/**
* @brief Macro for CAN_WMBn_CS register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_WMB_CS(offset, mb)           ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                        (uint32)(FLEXCAN_CAN_WMB_CS_U32) + \
                                                        (uint32)((mb) * 0x10U) ))
                                                        
/**
* @brief Macro for CAN_WMBn_ID register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_WMB_ID(offset, mb)           ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                        (uint32)(FLEXCAN_CAN_WMB_ID_U32) + \
                                                        (uint32)((mb) * 0x10U) ))

/**
* @brief Macro for CAN_WMB_D03 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_WMB_D03(offset, mb)           ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                        (uint32)(FLEXCAN_CAN_WMB_D03_U32) + \
                                                        (uint32)((mb) * 0x10U) ))
                                                        
/**
* @brief Macro for CAN_WMB_D47 register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_CAN_WMB_D47(offset, mb)           ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + \
                                                        (uint32)(FLEXCAN_CAN_WMB_D47_U32) + \
                                                        (uint32)((mb) * 0x10U) ))
/**
* @brief Macro for Control FD Register (FDCTRL) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_FDCTRL(offset)        ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0xC00U ) )


/**
* @brief Macro for FD Bit Timing register (FDCBT) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define FLEXCAN_FDCBT(offset)        ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0xC04U ) ) 

/**
* @brief Macro for Bit Timing register (CBT) register access
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXCAN_CBT(offset)        ( (uint32)( CAN_GET_BASE_ADDRESS(offset) + 0x50U ) )
/*==================================================================================================
                            FLEXCAN Register Configuration Macros
==================================================================================================*/

/*==================================================================================================
                            FLEXCAN Register Read Macros
==================================================================================================*/



/*==================================================================================================
                              FLEXCAN Register Bit Configuration Macros
==================================================================================================*/



/**@}*/

/**
* @{
* @brief MECR Register: BASE + 0x0AE0 bits set
* @violates @ref Reg_eSys_FlexCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/



/*Calculate the number of CAN controllers available on the platform */
#ifdef  FLEXCAN0_BASEADDR
        #define FLEXCAN0_AVAILABLE    1U
#else    
        #define FLEXCAN0_AVAILABLE    0U    
#endif /* FLEXCAN0_BASEADDR */

#ifdef  FLEXCAN1_BASEADDR
        #define FLEXCAN1_AVAILABLE    1U
#else    
        #define FLEXCAN1_AVAILABLE    0U    
#endif /* FLEXCAN1_BASEADDR */

#ifdef  FLEXCAN2_BASEADDR
        #define FLEXCAN2_AVAILABLE    1U
#else    
        #define FLEXCAN2_AVAILABLE    0U    
#endif /* FLEXCAN2_BASEADDR */

