marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Can_TS_T40D2M10I1R0/include/Reg_eSys_FlexCan.h
#ifdef  FLEXCAN3_BASEADDR
        #define FLEXCAN3_AVAILABLE    1U
#else    
        #define FLEXCAN3_AVAILABLE    0U    
#endif /* FLEXCAN3_BASEADDR */

#ifdef  FLEXCAN4_BASEADDR
        #define FLEXCAN4_AVAILABLE    1U
#else    
        #define FLEXCAN4_AVAILABLE    0U    
#endif /* FLEXCAN4_BASEADDR */

#ifdef  FLEXCAN5_BASEADDR
        #define FLEXCAN5_AVAILABLE    1U
#else    
        #define FLEXCAN5_AVAILABLE    0U    
#endif /* FLEXCAN5_BASEADDR */

#ifdef  FLEXCAN6_BASEADDR
        #define FLEXCAN6_AVAILABLE    1U
#else    
        #define FLEXCAN6_AVAILABLE    0U    
#endif /* FLEXCAN6_BASEADDR */

#ifdef  FLEXCAN7_BASEADDR
        #define FLEXCAN7_AVAILABLE    1U
#else    
        #define FLEXCAN7_AVAILABLE    0U    
#endif /* FLEXCAN7_BASEADDR */
/*Calculate the controllers number available on this platform*/
#define FLEXCAN_CONTROLLERS_NO    (FLEXCAN0_AVAILABLE+FLEXCAN1_AVAILABLE+FLEXCAN2_AVAILABLE+FLEXCAN3_AVAILABLE+FLEXCAN4_AVAILABLE+FLEXCAN5_AVAILABLE+FLEXCAN6_AVAILABLE+FLEXCAN7_AVAILABLE)

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/

/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/
#define CAN_START_SEC_CONST_UNSPECIFIED
/* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h */

#include "Can_MemMap.h"

extern CONST(uint32, CAN_CONST) Can_u32BaseAddress[FLEXCAN_CONTROLLERS_NO];

#define CAN_STOP_SEC_CONST_UNSPECIFIED
/*
* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/


#include "Can_MemMap.h"

/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

#define CAN_START_SEC_CONFIG_DATA_UNSPECIFIED
/*
* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "Can_MemMap.h"


#define CAN_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/*
* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "Can_MemMap.h"

/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/
#define CAN_START_SEC_CODE
/*
* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "Can_MemMap.h"

#define CAN_STOP_SEC_CODE
/*
* @violates @ref Reg_eSys_FlexCan_h_REF_2 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "Can_MemMap.h"

#ifdef __cplusplus
}
#endif

#endif /*TEMPLATE_H*/

/** @} */
